<?php
	for( $i = 1; $i <= 9; $i++ ) {                       		//外层循环执行9次，用来输出9行
		for( $j = 1; $j <=$i; $j++ ) {                   		//内层循环执行次数由外层循环决定
			echo "$j x $i = ".$j*$i."&nbsp;&nbsp;";    			//执行一次输出一个乘法等式和两个空格
		}
		echo "<br>";                               				//内层循环执行后换行
	}	
	echo "<br>"; 
	
	//在外层for语句中将初始化条件设置为大值，增量设置为递减
	for( $i = 9; $i >= 1; $i-- ) {  
		//在内层for语句中将初始化条件也设置为大值，增量也设置为递减
		for( $j = $i; $j >=1; $j-- ) {  		
			echo "$j x $i = ".$j*$i."&nbsp;&nbsp;";
		}
		echo "<br>";
	}
	
?>
